# Question 3

Housing
Step 1. Import the necessary libraries
Step 2. Create 3 differents Series, each of length 100, as follows:
• The first a random number from 1 to 4
• The second a random number from 1 to 3
• The third a random number from 10,000 to 30,000
Step 3. Create a DataFrame by joinning the Series by column
Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter
Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'
Step 6. Ops it seems it is going only until index 99. Is it true?
Step 7. Reindex the DataFrame so it goes from 0 to 299

**Step 1. Import the necessary libraries**

In [18]:
import numpy as np
import pandas as pd
import random

**Step 2. Create 3 differents Series, each of length 100, as follows:
• The first a random number from 1 to 4
• The second a random number from 1 to 3
• The third a random number from 10,000 to 30,000**

In [19]:
series1 = pd.Series(np.random.randint(1,5,100))
series2 = pd.Series(np.random.randint(1,4,100))
series3 = pd.Series(np.random.randint(10000,30000,100))

**Step 3. Create a DataFrame by joinning the Series by column**

In [20]:
dfSeries = pd.DataFrame({'A':series1, 'B': series2, 'C' :series3})
dfSeries.head()

   A  B      C
0  1  1  25144
1  3  2  21604
2  3  1  13816
3  2  2  25449
4  3  3  14160

**Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter**

In [22]:
dfSeries.rename({'A':'bedrs', 'B':'bathrs', 'C':'price_sqr_meter'}, axis='columns')

    bedrs  bathrs  price_sqr_meter
0       1       1            25144
1       3       2            21604
2       3       1            13816
3       2       2            25449
4       3       3            14160
..    ...     ...              ...
95      2       1            27888
96      3       2            11027
97      2       2            15556
98      3       2            19147
99      4       3            12324

[100 rows x 3 columns]

**Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'**

In [23]:
bigcolumn = pd.DataFrame(pd.concat([series1, series2, series3], axis=0))
bigcolumn

        0
0       1
1       3
2       3
3       2
4       3
..    ...
95  27888
96  11027
97  15556
98  19147
99  12324

[300 rows x 1 columns]

**Step 6. Ops it seems it is going only until index 99. Is it true?**

Yes, as shown above index range is upto 99

**Step 7. Reindex the DataFrame so it goes from 0 to 299**

In [25]:
bigcolumn.reset_index(drop=True)

         0
0        1
1        3
2        3
3        2
4        3
..     ...
295  27888
296  11027
297  15556
298  19147
299  12324

[300 rows x 1 columns]